<?php
/////////////////////////////////////////////////////////////////////////////////
/*-----------------------------------Mysqli------------------------------------*/
/////////////////////////////////////////////////////////////////////////////////
$host = "localhost";
$username = "u148682720_test";
$password = "egtXOIZTaE1y";
$db = "u148682720_test";
$connecton = new mysqli($host, $username, $password, $db);



/////////////////////////////////////////////////////////////////////////////////
/*----------------------------------Variables----------------------------------*/
/////////////////////////////////////////////////////////////////////////////////
$token = '531869b815ab2be7dc35b23da36f471dea8bf840e884ffae95dafc0f7e16e51ac48ad458b00dbd39a8807';



/////////////////////////////////////////////////////////////////////////////////
/*----------------------------------Log error----------------------------------*/
/////////////////////////////////////////////////////////////////////////////////
ini_set('display_errors', 1);
ini_set('error_reporting', E_ALL & ~E_NOTICE);
ini_set('log_errors', 1);
ini_set('error_log','log.txt');



/////////////////////////////////////////////////////////////////////////////////
/*-----------------------------------Classes-----------------------------------*/
/////////////////////////////////////////////////////////////////////////////////
include "../lib/trello.php";
include_once "../lib/requests.php";



/////////////////////////////////////////////////////////////////////////////////
/*-----------------------------------Take key----------------------------------*/
/////////////////////////////////////////////////////////////////////////////////
function give_key($user_id,$connecton){
//--Смотрим ключ у user(a)--//
    $request = $connecton->query("SELECT user_key FROM users WHERE user_id ='$user_id'");
    $own = $request->fetch_row();
    $key_from_base =$own[0];
//--------------------------//   

    if($key_from_base == NULL){
//--Получаем ключ,если у user(a) еще нет такового--//
        $request = 'apikey=ZBLdSJKop88KoGdSyvcoZvAqZFYFo0eNrXrI1RGdfGTiUvutkATehj3mqcb4jtHK';
        $url = 'https://emtechgroup.ru/busgo/users/key/';
        $result = POST($url,$request);
        $response = $result[invite];
        $request = $connecton->query("INSERT INTO users (user_id, user_key) VALUES ('$user_id', '$key')");
//------------------------------------------------//   
    }else{
//--Если у юзера уже есь ключ или он активирован--//    
        if($key_from_base != Null) $response = $key_from_base;
        
        if($key_from_base == 'used') $response = "Вы уже активировали свой ключ!";
    }
//-----------------------------------------------//    
return $response; 
}



/////////////////////////////////////////////////////////////////////////////////
/*-----------------------------------Test key----------------------------------*/
/////////////////////////////////////////////////////////////////////////////////
if($_POST['keyUsed'] == null) return 'error';

//--Ищем user(a) по ключу--//
    $request = $connecton->query("SELECT user_id FROM users WHERE user_key='{$_POST['keyUsed']}'");
    $user_from_base = $request->fetch_row();
    $user_id = $user_from_base[0];
//------------------------//   

    if($user_from_base != null) {
//--Заменяем найденый ключ у пользователя на "used" и оповещаем user(a) об успешной активации--//
        $request = $connecton->query("UPDATE users SET user_key = 'used' WHERE user_id = '$user_id'");
        
        $request_params = array( 
            'message' => 'Ваш ключ был активирован!',
            'user_id' => $user_id, 
            'access_token' => $token, 
            'v' => '5.69' 
        ); 
        POST("https://api.vk.com/method/messages.send",$request_params);
//---------------------------------------------------------------------------------------------//
    }
    
    
    
/////////////////////////////////////////////////////////////////////////////////
/*--------------------------------------End------------------------------------*/
/////////////////////////////////////////////////////////////////////////////////
echo('ok');
$connecton->close();
?>